
// 1 - Створити масив з 10 числових елементів. Вивести в консоль всі
// його елементи в циклі.
//     #GamKju89ob
// 2- Створити масив з 10 строкрових елементів. Вивести в консоль всі його
// елементи в циклі.
//     #Bm76xmg
// 3- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його
// елементи в циклі.
//     #u3vmD0YJXh
// 4- Створити масив з 10 елементів числового, стірчкового і булевого типу.
//     За допомогою if та typeof вивести тільки булеві елементи
// #9stMq2ou
// 5- Створити масив з 10 елементів числового, стірчкового і булевого типу.
//     За допомогою if та typeof вивести тільки числові елементи
// #mK4pmM4
// 6- Створити масив з 10 елементів числового, стрічкового і булевого типу.
//     За допомогою if та typeof вивести тільки рядкові елементи
// 7 - Створити порожній масив. Наповнити його 10 елементами
// (різними за типами) через звернення до конкретних індексів.
//     Вивести в консоль всі його елементи в циклі.
// - 8 Створити цикл for на 10  ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
// 9 -Створити цикл for на 100 ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write


// 1 - Створити масив з 10 числових елементів. Вивести в консоль всі
// його елементи в циклі.
// let numbers = [10, 12, 54, 34, -1, 23, 0, 54, 3245, 3344,];
// for (let i = 0; i < numbers.length; i++) {
//         console.log(numbers[i]);
// };

// 2- Створити масив з 10 строкрових елементів. Вивести в консоль всі його
// елементи в циклі.
// let words = ['hi', 'lol', 'octen', 'man', 'chill',
// 'low', 'brick', 'nine', 'box', 'small'];
// for (let i = 0; i < words.length; i++) {
//         console.log(words[i]);
// };

// 4- Створити масив з 10 елементів числового, стірчкового і булевого типу.
//     За допомогою if та typeof вивести тільки булеві елементи
//
// let items = ['hi', 'lol', 'octen', 'man', 'chill',
// 'low', 'brick', false, 0, true];
//
// for (let i = 0; i < items.length; i++) {
//     if (typeof items[i] === 'boolean')  {
//                 console.log( items[i])
//         }
// };

// - 7 Створити порожній масив. Наповнити його 10 елементами
// (різними за типами) через звернення до конкретних індексів.
//     Вивести в консоль всі його елементи в циклі.
// let items = ['hi', 'lol', 'octen', 'man', 'chill',
// 'low', 'brick', false, 0, true];
//
// for (let i = 0; i < items.length; i++) {
//         console.log(items[i]);
// };

// - 8 Створити цикл for на 10  ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
// let items = ['hi', 'lol', 'octen', 'man', 'chill',
// 'low', 'brick', false, 0, true];
//
// for (let i = 0; i < items.length; i++) {
//         console.log(items[i]);
//         document.write(items[i])
// }


// 9 -Створити цикл for на 100 ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write

// let items = ['hi', 'lol', 'octen', 'man', 'chill',
// 'low', 'brick', false, 0, true];
//
// for (let i = 0; i < 100; i++) {
//         console.log(items[i]);
//         document.write(items[i])
// }

// - Створити цикл for / Вивести тільки парні кроки.
// через console.log + document.write

let items = ['hi', 'lol', 'octen', 'man', 'chill',
'low', 'brick', false, 0, true];

for (let i = 0; i < items.length; i++ ) {
        console.log(items[i]);
        document.write(items[i])
}














